[
  {
    "qa": "Security",
    "definition": "The architecture includes procedures for informing employees about security-relevant events and provides guidance for administrators to handle security threats.",
    "sustainability_dimensions": [
      {
        "dimension": "Social",
        "justification": "The document emphasizes the importance of raising awareness among all employees about security threats."
      },
      {
        "dimension": "Technical",
        "justification": "The architecture includes procedures for informing employees about security-relevant events and provides guidance for administrators to handle security threats, indicating a focus on technical security measures."
      }
    ]
  },
  {
    "qa": "Availability",
    "definition": "The Corona-Warn-App Server, Verification Server, and Portal Server are designed to provide data in a RESTful format, making it available through a transparent CDN.",
    "sustainability_dimensions": [
      {
        "dimension": "Economic",
        "justification": "The availability of data is crucial for the app's functionality, reducing the need for frequent requests and increasing efficiency."
      },
      {
        "dimension": "Technical",
        "justification": "The architecture ensures that data can be accessed in a standardized format, facilitating integration with other systems."
      }
    ]
  },
  {
    "qa": "Recoverability",
    "definition": "The system includes mechanisms for logging and monitoring events to detect suspicious behavior or trends in real-time.",
    "sustainability_dimensions": [
      {
        "dimension": "Technical",
        "justification": "The architecture focuses on event correlation and analytics, enabling the detection of security threats."
      },
      {
        "dimension": "Economic",
        "justification": "Reducing downtime due to security incidents is crucial for maintaining customer satisfaction and trust."
      }
    ]
  },
  {
    "qa": "Performance",
    "definition": "The architecture includes mechanisms for reducing the number of requests, allowing for efficient data retrieval and processing.",
    "sustainability_dimensions": [
      {
        "dimension": "Economic",
        "justification": "The system's performance optimization reduces the need for frequent requests, minimizing costs associated with data transfer."
      }
    ]
  },
  {
    "qa": "Modifiability",
    "definition": "The architecture isolates jurisdiction-specific logic in separate modules, allowing rapid updates when laws change.",
    "sustainability_dimensions": [
      {
        "dimension": "Technical",
        "justification": "The modular design facilitates localized changes."
      },
      {
        "dimension": "Economic",
        "justification": "Reducing engineering time needed for compliance updates is crucial for maintaining competitiveness."
      }
    ]
  },
  {
    "qa": "Testability",
    "definition": "The system includes mechanisms for security testing to identify vulnerabilities and ensure compliance with regulations.",
    "sustainability_dimensions": [
      {
        "dimension": "Technical",
        "justification": "Security testing assesses if system and configuration settings are compliant to the security requirements."
      },
      {
        "dimension": "Economic",
        "justification": "Regular security testing reduces the risk of data breaches, minimizing costs associated with potential losses."
      }
    ]
  },
  {
    "qa": "Usability",
    "definition": "The architecture provides various user-friendly tools and interfaces, including a user manual, tutorial, and hotlines, to support users in understanding and using the app.",
    "sustainability_dimensions": [
      {
        "dimension": "Social",
        "justification": "Ensures that all persons with disabilities can use the apps from public authorities."
      },
      {
        "dimension": "Economic",
        "justification": "Reduces support costs by providing clear and accessible information to users."
      }
    ]
  },
  {
    "qa": "Verifiability",
    "definition": "The architecture ensures that the diagnosis keys can be uploaded only after a verification process, which includes receiving positive tests results from a verification server or through a human-readable token.",
    "sustainability_dimensions": [
      {
        "dimension": "Economic",
        "justification": "Prevents misuse of the app and reduces potential losses due to incorrect information."
      },
      {
        "dimension": "Social",
        "justification": "Ensures that users receive accurate and reliable information about their exposure and infection status."
      }
    ]
  },
  {
    "qa": "Maintainability",
    "definition": "The architecture supports investigations and remediation of vulnerabilities, undiscovered threats, and architectural/processing vulnerabilities.",
    "sustainability_dimensions": [
      {
        "dimension": "Economic",
        "justification": "Identifies and addresses vulnerabilities before they can be exploited, reducing potential losses."
      },
      {
        "dimension": "Social",
        "justification": "Provides support for incident response processes and legal/disciplinary actions, ensuring compliance with regulations and industry standards."
      }
    ]
  },
  {
    "qa": "Security",
    "definition": "The system includes security measures to protect against unauthorized access and modification. It also supports service continuity and disaster recovery.",
    "sustainability_dimensions": [
      {
        "dimension": "Economic",
        "justification": "Protection against data breaches and unauthorized access minimizes financial losses."
      },
      {
        "dimension": "Technical",
        "justification": "The system is designed to prevent cyber attacks, including distributed denial-of-service (DDoS) attacks and coordinated persistent attacks."
      }
    ]
  },
  {
    "qa": "Availability",
    "definition": "The Corona-Warn-App provides real-time communication channels in case of an incident. It also ensures the availability of a human-readable token for verification.",
    "sustainability_dimensions": [
      {
        "dimension": "Social",
        "justification": "Real-time communication with authorities and stakeholders is required to inform others about relevant exposure and potential infection."
      },
      {
        "dimension": "Economic",
        "justification": "Timely notification of test results minimizes business disruption."
      }
    ]
  },
  {
    "qa": "Intuitiveness",
    "definition": "The Corona-Warn-App provides help tools for using the app, including user manual and tutorials. It also offers information about the app's functionality.",
    "sustainability_dimensions": [
      {
        "dimension": "Social",
        "justification": "User-friendly interface supports accessibility for all persons with disabilities."
      },
      {
        "dimension": "Economic",
        "justification": "Clear instructions reduce support requests and costs associated with training users."
      }
    ]
  },
  {
    "qa": "Responsiveness",
    "definition": "The system is designed to detect suspicious events or dangerous trends in real-time. It also supports investigations in the context of intrusions, breaches, regulatory or policy violations.",
    "sustainability_dimensions": [
      {
        "dimension": "Technical",
        "justification": "Real-time detection and analysis minimize the impact of security incidents."
      },
      {
        "dimension": "Economic",
        "justification": "Quick response to security threats reduces costs associated with incident resolution."
      }
    ]
  },
  {
    "qa": "Flexibility",
    "definition": "The Corona-Warn-App allows users to scan QR codes or provide human-readable tokens for verification. It also supports different types of testing, including security and compliance testing.",
    "sustainability_dimensions": [
      {
        "dimension": "Technical",
        "justification": "Flexible design accommodates different user needs and scenarios."
      },
      {
        "dimension": "Economic",
        "justification": "Adaptability reduces costs associated with custom development and maintenance."
      }
    ]
  }
]